# running in or1200_formal_bmc_basic/model/
read_rtlil design_prep.il
hierarchy -smtcheck
delete */t:$print
formalff -assume
dffunmap
stat
write_smt2 -wires design_smt2.smt2
