# running in test_2_prove/src/
read -formal test_2.v
prep -top place_holder

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
